1s/ERP/Conf/Catalogs/Лико_Псевдонимы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Псевдонимы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаМатериала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ГруппыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Псевдонимы/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_Псевдонимы.Номер КАК Номер
		|ИЗ
		|	Справочник.Лико_Псевдонимы КАК Лико_Псевдонимы
		|ГДЕ
		|	Лико_Псевдонимы.ГруппаМатериала = &ГруппаМатериала
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
		
		Запрос.УстановитьПараметр("ГруппаМатериала", ГруппаМатериала);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Номер = ВыборкаДетальныеЗаписи.Номер + 1;
		Иначе
			Номер = 1	
		КонецЕсли;
		Наименование = ГруппаМатериала.Наименование + " " + Строка(Номер);
	КонецЕсли;
	
КонецПроцедуры
